---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModel
source: html/f7969063-3865-a7b1-a7f2-33d0634bb994.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModel Property

A sweep in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingSweepByElementsInMainModel { get; }
```